app/views/shared/_nav.html.erb

    <div class="navbar-nav">
      <% Category.all.each do |category| %>
---
SELECT "categories".* FROM "categories"