app/controllers/posts_controller.rb

SELECT "categories".* FROM "categories"
SELECT "posts".* FROM "posts" ORDER BY created_at DESC
SELECT  "categories".* FROM "categories" WHERE "categories"."name" = $1 LIMIT $2  [["name", "Nos Expressions"], ["LIMIT", 1]]
SELECT "posts".* FROM "posts" WHERE "posts"."category_id" = $1 ORDER BY created_at DESC  [["category_id", 1]]
---
  def index
    if params[:category].blank?
      @posts = Post.all.order("created_at DESC")
    else
      @category_id = Category.find_by(name: params[:category]).id
      @posts = Post.where(category_id: @category_id).order("created_at DESC")